# python_ikm_sem2
ИКМ по Python(вариант 9)
Выполнил студент группы ИТ-8-2024 Рогозин Егор Алексеевич

Поставленная задача:
Реализуйте структуру данных "стек". Напишите программу, содержащую описание стека и моделирующую работу стека, реализовав все указанные здесь методы. Программа считывает последовательность команд и в зависимости от команды выполняет ту или иную операцию. После выполнения каждой команды программа должна вывести одну строчку. Возможные команды для программы:
push n - Добавить в стек число n (значение n задается после команды). Программа должна вывести ok.
pop - Удалить из стека последний элемент. Программа должна вывести его значение.
back - Программа должна вывести значение последнего элемента, не удаляя его из стека.
size - Программа должна вывести количество элементов в стеке.
clear - Программа должна очистить стек и вывести ok.
exit - Программа должна вывести bye и завершить работу.
Входные данные: команды управления стеком вводятся в описанном ранее формате по 1 на строке. Гарантируется, что набор входных команд удовлетворяет следующим требованиям: максимальное количество элементов в стеке в любой момент не превосходит100, все команды pop и back корректны, то есть при их исполнении в стеке содержится хотя бы один элемент.
Выходные данные: протокол работы со стеком, по 1 сообщению в строке.
Примеры:
push 3
ok
push 14
ok
size
2
clear
ok
push 1
ok
back
1
push 2
ok
back
2
pop
2
size
1
pop
1
size
0
exit
bye

Стек был построен с помощью списка, так как размер стека постоянно меняется и по структуре они похожи.


Был реализован класс MyStack, в котором прописаны необходимые функции для работы программы:
def __init__(self):
            self._data = []
Конструктор по умолчанию, устанавливает начальное значение нашему стеку(изначально он будет пустым)

def push(self, item):
            self.add = [item]
            self._data += self.add
Метод для добавления новых значений. Работает с помощью конвертации добавляемого элемента в первый элемент списка и объединения его с нашим стеком

def size(self):
            self.length = 0
            for self.item in self._data:
               self.length += 1
            return self.length
Метод для вывода размера стека. Проходит по всем элементам и считает количество

def last(self):
           return self._data[-1]
Возвращает последний элемент без его удаления(для команды "back")
Индекс [-1] указывает на последний элемент

def pop(self):
           self.element = self._data[-1]
           del self._data[-1]
           return self.element
Возвращает последний элемент и удаляет его. Сохраняет последний элемент в переменную для последующего его вывода и удаляет его из стека

def clear(self):
           self._data = []
           return self._data
Удаляет все элементы из стека путем обозначения стека заново

Дальше идет метод, который отвечает за выполнение команд, принимает в параметры команду и аргументы(если они были, к примеру если был прописан push)

if command == "size":
        print(stack.size())
Вызов классовой функции для вывода размера стека

elif command == "back":
      try:  
        print(stack.last())
      except IndexError:
        print('index error(a stack has no elements)')
Вызов команды для вывода последнего элемента. Если стек пустой, то обрабатывается исключение IndexError и выводится сообщение о том что в стеке нет элементов

elif command == "pop":
      try:
        print(stack.pop())
      except IndexError:
        print('index error(a stack has no elements)')
Вызов классового метода pop. Так же обработка того же исключения как в случае с "back"

elif command == "clear":
        stack.clear()
        print("ok")
Вызов метода и вывод "ok"

elif command == "push":
      try:
        stack.push(int(args[0]))
        print("ok")
      except ValueError:
        print('value error(an element "', args[0], '" is not a number)')
      except IndexError:
        print('index error(input an element)')
Вызов метода с обработкой двух исключений. ValueError обрабатывается в случае, если при вводе после "push" было введено не числовое значение.
IndexError обрабатывается если при вводе после "push" ничего не было введено (только сам "push")

elif command == "exit":
        print("bye")

else:
       print('command "', command, '" does not exist')
Случай если введена несуществующая команда

В самой программе сначала обозначается стек:
stack = MyStack()

Дальше запускается бесконечный цикл который принимает ввод с клавиатуры и вызывает метод выполнения комманд:
while True:
    command, *args = input().split()
    Command(command, *args)

Цикл заканчивается если была прописана команда "exit":
    if command == "exit":
      break

